Autodesk.Revit.DB.BuiltInFailures.InterferenceFailures.GeometryWarning
A geometrical error has occurred while checking for Interference. Reported interference may not be accurate.

Autodesk.Revit.DB.BuiltInFailures.InterferenceFailures
Failures about Interference.